var map = L.map('map').setView([46.8651082,104.3401555], 6);
L.tileLayer('http://{s}.tiles.mapbox.com/v3/mapmeld.map-x20zuxfw/{z}/{x}/{y}.png').addTo(map);

var markers = [
  ['ᠤᠯᠠᠭᠠᠨᠪᠠᠭᠠᠲᠤᠷ', 47.916667, 106.916667],
  ['ᠴᠣᠶᠢᠷ', 46.360556, 108.365],
  ['ᠮᠥᠷᠡᠨ', 49.635556, 100.155556],
  ['ᠠᠷᠪᠠᠶᠢᠬᠡᠭᠡᠷ', 46.266111, 102.777778],
  ['ᠰᠦᠬᠡᠪᠠᠭᠠᠲᠤᠷ', 50.236389, 106.206389],
  ['ᠥᠯᠦᠭᠡᠢ', 48.968333, 89.968611],
  ['ᠴᠡᠴᠡᠷᠯᠢᠭ', 47.476944, 101.450278],
  ['ᠳᠠᠷᠬᠠᠨ', 49.468889, 105.9575],
  ['ᠬᠣᠪᠳᠤ', 48.004167, 91.640556],
  ['ᠵᠠᠭᠤᠨᠮᠣᠳᠤ', 47.706944, 106.949444],
  ['ᠪᠠᠶ᠋ᠠᠩᠬᠣᠩᠭ᠋ᠤᠷ', 46.191667, 100.717778],
  ['ᠡᠷᠳᠡᠨᠢᠲᠦ', 49.027778, 104.044444],
  ['ᠤᠯᠢᠶ᠋ᠠᠰᠤᠲᠠᠢ', 47.742778, 96.843333],
  ['ᠤᠯᠠᠭᠠᠩᠭ᠋ᠣᠮ', 49.986389, 92.071944],
  ['ᠴᠣᠶᠢᠪᠠᠯᠰᠠᠩ', 48.078333, 114.535],
  ['ᠥᠨᠳᠦᠷᠬᠠᠨ', 47.316667, 110.65],
  ['ᠪᠤᠯᠠᠭᠠᠨ', 48.811944, 103.533611],
  ['ᠠᠯᠲᠠᠢ', 46.372778, 96.257222],
  ['ᠰᠠᠶᠢᠩᠰᠠᠩᠳᠠ', 44.891667, 110.136667],
  ['ᠪᠠᠷᠠᠭᠤᠨ ᠤᠷᠲᠤ', 46.681389, 113.280278],
  ['ᠳᠠᠯᠠᠨᠵᠠᠳᠠᠭᠠᠳ', 43.57, 104.425833],
  ['ᠮᠠᠨᠳᠠᠯᠭᠣᠪᠢ', 45.766667, 106.269722]
];

for (var m = 0; m < markers.length; m++) {
  var marker = markers[m];
  L.marker(marker.slice(1, 3)).addTo(map).bindPopup('<div class="rotate">' + marker[0] + '</div>');
}
